In [1]:
import sqlite3

In [2]:
#Create connection
conn =sqlite3.connect('school.db') 
cursor = conn.cursor()

In [3]:
# Create tables
cursor.execute('''CREATE TABLE IF NOT EXISTS students ( id INTEGER PRIMARY KEY AUTOINCREMENT, name TEXT, age INTEGER, gender TEXT )''') 
cursor.execute('''CREATE TABLE IF NOT EXISTS courses ( id INTEGER PRIMARY KEY AUTOINCREMENT, name TEXT, credits INTEGER )''')
cursor.execute('''CREATE TABLE IF NOT EXISTS enrollments ( 
               id INTEGER PRIMARY KEY AUTOINCREMENT, student_id INTEGER, course_id INTEGER, grade REAL, FOREIGN KEY(student_id) REFERENCES students(id), FOREIGN KEY(course_id) REFERENCES courses(id) )''')

In [4]:
cursor.executemany('INSERT INTO students (name, age, gender) VALUES (?, ?, ?)', [

('Alice', 22, 'F'),

('Bob', 20, 'M'),

('Charlie', 23, 'M')

])


cursor.executemany('INSERT INTO courses (name, credits) VALUES (?, ?)', [

('Math', 3),

('Science', 4),

('History', 2)

])


cursor.executemany('INSERT INTO enrollments (student_id, course_id, grade) VALUES (?, ?, ?)', [

(1, 1, 85),

(1, 2, 90),

(2, 1, 78),

(3, 3, 88)

])


conn.commit()

In [6]:
cursor.execute("SELECT * FROM students")

print(cursor.fetchall())

[(1, 'Alice', 22, 'F'), (2, 'Bob', 20, 'M'), (3, 'Charlie', 23, 'M')]

In [7]:
# Insert a new student

cursor.execute("INSERT INTO students (name, age, gender) VALUES ('David', 21, 'M')")

conn.commit()

In [8]:
# Filter students older than 21

cursor.execute("SELECT * FROM students WHERE age > 21")
print(cursor.fetchall())

[(1, 'Alice', 22, 'F'), (3, 'Charlie', 23, 'M')]

In [9]:
# Retrieve students with grades between 80 and 90

cursor.execute('''SELECT s.name, e.grade

FROM students s
JOIN enrollments e ON s.id = e.student_id

WHERE e.grade BETWEEN 80 AND 90''')

print(cursor.fetchall() )

[('Alice', 85.0), ('Alice', 90.0), ('Charlie', 88.0)]

In [10]:
# Total credits for each course
cursor.execute("SELECT name, credits FROM courses")

print(cursor.fetchall() )

[('Math', 3), ('Science', 4), ('History', 2)]

In [13]:
# Students sorted by age descending

cursor.execute("SELECT * FROM students ORDER BY age DESC")

print(cursor.fetchall())

[(3, 'Charlie', 23, 'M'), (1, 'Alice', 22, 'F'), (4, 'David', 21, 'M'), (2, 'Bob', 20, 'M')]

In [14]:
# Students not enrolled in any courses (LEFT JOIN)

cursor.execute('''SELECT s.name

FROM students s
               LEFT JOIN enrollments e ON s.id = e.student_id

WHERE e.id IS NULL''')

print(cursor.fetchall())

[('David',)]

In [16]:
cursor.execute('''
SELECT s.name, e.course, e.grade
FROM students s
JOIN enrollments e ON s.student_id = e.student_id
WHERE e.course = 'Math' AND e.grade > 80
''')
print("\nStudents enrolled in 'Math' with grades above 80:")
for row in cursor.fetchall():
    print(row)

OperationalError: no such column: e.course